<?php

namespace App\Models;
use DB;
use Illuminate\Database\Eloquent\Model;

class AdvantModel extends Model {
    /****************************************************************
     * Получение списка
     * ************************************************************/
    public static function getList () {

    }

    /****************************************************************
     * Получение единицы
     * ************************************************************/
    public static function getItem ($id) {

    }

    /****************************************************************
     * Обновление единицы
     * ************************************************************/
    public static function updateItem ($id) {

    }

    /****************************************************************
     * Добавление единицы
     * ************************************************************/
    public static function setItem ($id) {

    }

    /****************************************************************
     * Удаление единицы
     * ************************************************************/
    public static function deleteItem ($id) {

    }
}