<?php
namespace App\Models;

use DB;
use Illuminate\Database\Eloquent\Model;


class UserModel extends Model {
    /****************************************************************
     * Получение списка
     * ************************************************************/
    public static function getList () {
    }

    /****************************************************************
     * Получение единицы
     * ************************************************************/
    public static function getItem ($id) {

    }

    /****************************************************************
     * Обновление единицы
     * ************************************************************/
    public static function updateItem ($id) {

    }

    /****************************************************************
     * Добавление единицы
     * ************************************************************/
    public static function addItem ($id) {

    }

    /****************************************************************
     * Удаление единицы
     * ************************************************************/
    public static function deleteItem ($id) {

    }

}